print("Умова: Напишіть програму, яка отримує три числа і друкує їх суму.\nКожне число користувач вводить у окремому рядку.Вхідні дані: 3 дійсних числа.\nКожне число користувач вводить в окремому рядку.Вихідні дані: вивести суму трьох чисел на екран.")
# Програма для знахождення суми 3 чисел
# number1,number2,number3 - дійсні числа
number1 = float(input("Введіть перше число: "))
number2 = float(input("Введіть друге число: "))
number3 = float(input("Введіть третє число: "))
result = number1 + number2 + number3
# вивід суми
print("Сума трех чисел дорівнює: " + str(result))
